Revit 2024 API
Family.StructuralFamilyNameKey Property
 The family's structural section shape name key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string StructuralFamilyNameKey { get; set; }
Visual Basic
Public Property StructuralFamilyNameKey As String
	Get
	Set
Visual C++
public:
property String^ StructuralFamilyNameKey {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Family Class
Autodesk.Revit.DB Namespace